;--------------------------------------------------------------------
; Программа вывода сообщения на экран, ввода строки с клавиатуры и вывода введенной строки
;---------------------------------------------------------------------
%include 'in_out.asm' ; подключение внешнего файла

SECTION .data ; Секция инициированных данных
msg: DB 'Введите строку: ',0h ; сообщение
msg2: DB 'Вы ввели: ',0h ; сообщение для вывода введенной строки

SECTION .bss ; Секция не инициированных данных
buf1: RESB 80 ; Буфер размером 80 байт

SECTION .text ; Код программы
	GLOBAL _start ; Начало программы
	_start: ; Точка входа в программу
	mov eax, msg ; запись адреса выводимого сообщения в `EAX`
	call sprintLF ; вызов подпрограммы печати сообщения
	mov ecx, buf1 ; запись адреса переменной в `ECX`
	mov edx, 80 ; запись длины вводимого сообщения в `EDX`
	call sread ; вызов подпрограммы ввода сообщения
	mov eax, msg2 ; запись адреса выводимого сообщения в `EAX`
	call sprint ; вызов подпрограммы печати сообщения
	mov eax, buf1 ; запись адреса введенной строки в `EAX`
	call sprintLF ; вызов подпрограммы печати введенной строки
	call quit ; вызов подпрограммы завершения

